In [1]:
!which python

/Users/alaa.bakhti/miniconda3/envs/recsys_students/bin/python

In [2]:
!python --version

Python 3.8.5

In [3]:
!tree ../

../
├── README.md
├── data
│   └── movielens -> ../../../../data/movielens
├── doc
│   └── directory_hierarchy.png
├── notebooks
│   ├── AIS_EDA.ipynb
│   ├── DAS_EDA.ipynb
│   └── DAS_model-pipeline.ipynb
└── requirements.txt

4 directories, 6 files

In [4]:
from pathlib import Path
import pandas as pd

In [5]:
DATA_DIR = Path('../data/movielens/ml-latest')

RATINGS_FILEPATH = DATA_DIR / 'ratings.csv'
MOVIES_FILPATH = DATA_DIR / 'movies.csv'

# Ratings

In [6]:
ratings_raw = pd.read_csv(RATINGS_FILEPATH)
ratings_raw.sample(5)

          userId  movieId  rating   timestamp
16903666  172782    77561     3.0  1433391689
17698906  181027     6888     2.0  1131128649
12417024  127225     3969     3.5  1457236715
7468639    76890     7361     5.0  1509705686
6782994    69664     1127     3.0  1181163486

In [7]:
ratings = ratings_raw.copy()

In [8]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27753444 entries, 0 to 27753443
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 847.0 MB

In [9]:
ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [10]:
ratings.duplicated(keep=False).sum()

0

# Movies

In [11]:
movies_raw = pd.read_csv(MOVIES_FILPATH)
movies_raw.sample(5)

,movieId,title,genres
11917,53280,"Breed, The (2006)",Horror|Thriller
15520,78719,Ashes and Blood (2009),Drama
47085,169174,Higglety Pigglety Pop! or There Must Be More t...,Children|Fantasy
39131,151193,The Image (1975),Drama
39967,153132,Pop Skull (2007),Horror|Thriller

In [12]:
movies = movies_raw.copy()

In [13]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58098 entries, 0 to 58097
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  58098 non-null  int64
 1   title    58098 non-null  object
 2   genres   58098 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.3+ MB

In [14]:
movies.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [15]:
movies.duplicated().sum()

0

**Title + genre**

In [16]:
movies.duplicated(subset=['title', 'genres']).sum()

14

In [17]:
duplicates = movies[movies.duplicated(subset=['title', 'genres'], keep=False)]
duplicates

       movieId                        title                   genres
2560      2644               Dracula (1931)                   Horror
11173    46865            Little Man (2006)                   Comedy
11412    48682               Offside (2006)             Comedy|Drama
13504    66511        Berlin Calling (2008)             Comedy|Drama
14038    70155  Seven Years Bad Luck (1921)                   Comedy
15637    79254                  Home (2008)                    Drama
15902    80330               Offside (2006)             Comedy|Drama
18867    93279               Darling (2007)                    Drama
19914    97773             Girl, The (2012)                    Drama
20835   101212             Girl, The (2012)                    Drama
21655   104035               Beneath (2013)                   Horror
21691   104155         Clear History (2013)                   Comedy
23834   111519        Johnny Express (2014)  Animation|Comedy|Sci-Fi
25046   115777               Beneath (2013)                   Horror
27572   122940         Clear History (2013)                   Comedy
29852   128991        Johnny Express (2014)  Animation|Comedy|Sci-Fi
30226   130062               Darling (2007)                    Drama
33001   136564               Macbeth (2015)                    Drama
36172   143978                  Home (2008)                    Drama
38804   150310               Macbeth (2015)                    Drama
44387   163246  Seven Years Bad Luck (1921)                   Comedy
46904   168774                Detour (2017)                 Thriller
48620   172427            Little Man (2006)                   Comedy
51339   178401                 Lucky (2017)                    Drama
52192   180205               Dracula (1931)                   Horror
52644   181329                 Lucky (2017)                    Drama
52795   181655                Detour (2017)                 Thriller
57269   191775        Berlin Calling (2008)             Comedy|Drama

In [18]:
duplicates.title.values

array(['Dracula (1931)', 'Little Man (2006)', 'Offside (2006)',
       'Berlin Calling (2008)', 'Seven Years Bad Luck (1921)',
       'Home (2008)', 'Offside (2006)', 'Darling (2007)',
       'Girl, The (2012)', 'Girl, The (2012)', 'Beneath (2013)',
       'Clear History (2013)', 'Johnny Express (2014)', 'Beneath (2013)',
       'Clear History (2013)', 'Johnny Express (2014)', 'Darling (2007)',
       'Macbeth (2015)', 'Home (2008)', 'Macbeth (2015)',
       'Seven Years Bad Luck (1921)', 'Detour (2017)',
       'Little Man (2006)', 'Lucky (2017)', 'Dracula (1931)',
       'Lucky (2017)', 'Detour (2017)', 'Berlin Calling (2008)'],
      dtype=object)

In [19]:
for movie_title in duplicates.title.unique():
    display(movies[movies.title == movie_title])

       movieId           title  genres
2560      2644  Dracula (1931)  Horror
52192   180205  Dracula (1931)  Horror

       movieId              title  genres
11173    46865  Little Man (2006)  Comedy
48620   172427  Little Man (2006)  Comedy

       movieId           title        genres
11412    48682  Offside (2006)  Comedy|Drama
15902    80330  Offside (2006)  Comedy|Drama

       movieId                  title        genres
13504    66511  Berlin Calling (2008)  Comedy|Drama
57269   191775  Berlin Calling (2008)  Comedy|Drama

       movieId                        title  genres
14038    70155  Seven Years Bad Luck (1921)  Comedy
44387   163246  Seven Years Bad Luck (1921)  Comedy

       movieId        title genres
15637    79254  Home (2008)  Drama
36172   143978  Home (2008)  Drama

       movieId           title genres
18867    93279  Darling (2007)  Drama
30226   130062  Darling (2007)  Drama

       movieId             title genres
19914    97773  Girl, The (2012)  Drama
20835   101212  Girl, The (2012)  Drama

       movieId           title  genres
21655   104035  Beneath (2013)  Horror
25046   115777  Beneath (2013)  Horror

       movieId                 title  genres
21691   104155  Clear History (2013)  Comedy
27572   122940  Clear History (2013)  Comedy

       movieId                  title                   genres
23834   111519  Johnny Express (2014)  Animation|Comedy|Sci-Fi
29852   128991  Johnny Express (2014)  Animation|Comedy|Sci-Fi

       movieId           title genres
33001   136564  Macbeth (2015)  Drama
38804   150310  Macbeth (2015)  Drama

       movieId          title    genres
46904   168774  Detour (2017)  Thriller
52795   181655  Detour (2017)  Thriller

       movieId         title genres
51339   178401  Lucky (2017)  Drama
52644   181329  Lucky (2017)  Drama

In [20]:
ratings[ratings.movieId == 46865]

          userId  movieId  rating   timestamp
34191        332    46865     2.5  1160367907
124859      1215    46865     1.0  1185238454
227128      2231    46865     0.5  1191651526
413108      4208    46865     4.0  1221509439
475122      4836    46865     0.5  1342553315
...          ...      ...     ...         ...
27534644  280901    46865     4.0  1220666505
27555788  281096    46865     0.5  1166033444
27588229  281499    46865     1.5  1372546405
27661277  282242    46865     2.0  1325466212
27705218  282676    46865     3.0  1266952286

[455 rows x 4 columns]

In [21]:
ratings = ratings_raw.copy()

In [22]:
def replace_movie_id_in_rating_dataframe(dataframe: pd.DataFrame, new_movie_id: int, old_movie_id: int) \
    -> pd.DataFrame:
    dataframe.loc[dataframe.movieId == old_movie_id, 'movieId'] = new_movie_id
    return dataframe

ratings = replace_movie_id_in_rating_dataframe(ratings, 46865, 172427)

In [23]:
(ratings.movieId == 172427).sum()

0

In [24]:
def remove_old_movie_ids_from_movies_dataframe(dataframe: pd.DataFrame, old_movie_ids: [int]) -> pd.DataFrame:
    target_index = dataframe[dataframe.movieId.isin(old_movie_ids)].index
    dataframe = dataframe.drop(target_index)
    return dataframe

remove_old_movie_ids_from_movies_dataframe(movies, [1, 2, 3, 4])

,movieId,title,genres
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
...,...,...,...
58093,193876,The Great Glinka (1946),(no genres listed)
58094,193878,Les tribulations d'une caissière (2011),Comedy
58095,193880,Her Name Was Mumu (2016),Drama
58096,193882,Flora (2017),Adventure|Drama|Horror|Sci-Fi
58097,193886,Leal (2018),Action|Crime|Drama

In [25]:
def f(movies_dataframe: pd.DataFrame, ratings_dataframe: pd.DataFrame) -> (pd.DataFrame, pd.DataFrame):
    duplicates = movies_dataframe[movies_dataframe.duplicated(subset=['title', 'genres'], keep=False)]
    old_movie_ids = []
    for movie_title in duplicates.title.unique():
        movie_ids = duplicates[duplicates.title == movie_title].movieId.values
        new_movie_id, old_movie_id = movie_ids
        ratings_dataframe = replace_movie_id_in_rating_dataframe(ratings_dataframe, new_movie_id, old_movie_id)
        old_movie_ids.append(old_movie_id)
    movies_dataframe = remove_old_movie_ids_from_movies_dataframe(movies_dataframe, old_movie_ids)
    return movies_dataframe, ratings_dataframe

In [26]:
movies_df, ratings_df = f(movies, ratings)

In [27]:
len(movies_raw) - len(movies_df)

14

In [28]:
len(ratings_raw) - len(ratings_df)

0

**Title**

In [22]:
movies.title.duplicated().sum()

78

In [23]:
movies[movies.title.duplicated(keep=False)]

,movieId,title,genres
582,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
823,838,Emma (1996),Comedy|Drama|Romance
1716,1788,Men with Guns (1997),Action|Drama
2560,2644,Dracula (1931),Horror
2766,2851,Saturn 3 (1980),Adventure|Sci-Fi|Thriller
...,...,...,...
57269,191775,Berlin Calling (2008),Comedy|Drama
57305,191867,Let There Be Light (2017),Documentary
57361,192003,Journey to the Center of the Earth (2008),Action|Adventure|Fantasy|Sci-Fi
57463,192243,Contact (1992),Drama|Horror|Mystery|Thriller
57953,193559,Cargo (2017),Drama

In [24]:
movies[movies.title == 'Berlin Calling (2008)']

       movieId                  title        genres
13504    66511  Berlin Calling (2008)  Comedy|Drama
57269   191775  Berlin Calling (2008)  Comedy|Drama